-- phpMyAdmin SQL Dump
-- version 5.0.4
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Jan 31, 2021 at 07:13 PM
-- Server version: 10.4.17-MariaDB
-- PHP Version: 7.4.13

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `projects_shop_db`
--

-- --------------------------------------------------------

--
-- Table structure for table `admin_users`
--

CREATE TABLE `admin_users` (
  `id` int(11) NOT NULL,
  `name` varchar(256) NOT NULL,
  `email` varchar(256) NOT NULL,
  `password` varchar(256) NOT NULL,
  `created_at` date NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `admin_users`
--

INSERT INTO `admin_users` (`id`, `name`, `email`, `password`, `created_at`) VALUES
(7, 'ادمین', 'admin@gmail.com', '$2y$12$OWdfiUmy2jTnB.d77UvPxOc1ARN3a1Qkenmh4t.t03wKZEoUcucve', '2021-01-22'),
(9, 'محمد', 'mm@gmail.com', '$2y$12$1VLUJKwaRhwkqkAiSpqDXOUSlHT6TkuNGs8qEKL4wMBAAjlbkkkhG', '2021-01-22');

-- --------------------------------------------------------

--
-- Table structure for table `categories`
--

CREATE TABLE `categories` (
  `id` int(11) NOT NULL,
  `title` varchar(512) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `categories`
--

INSERT INTO `categories` (`id`, `title`) VALUES
(1, 'ویژه'),
(2, 'لپ تاپ'),
(7, 'لوازم آشپزخانه'),
(9, 'لوازم الکترونیکی'),
(10, 'کتاب الکترونیکی 2');

-- --------------------------------------------------------

--
-- Table structure for table `contact_us`
--

CREATE TABLE `contact_us` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `text` text NOT NULL,
  `created_at` date NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `contact_us`
--

INSERT INTO `contact_us` (`id`, `name`, `email`, `text`, `created_at`) VALUES
(1, 'لیلا بابایی', 'leila@gmai.com', 'من مشکلی درثبت سفارش دارم لطفا کمک کنید', '2021-01-30'),
(2, 'حسین محمدی', 'hosein@gmail.com', 'فروشگاه ما یکی از بهترین فورشگاه های کوجود در سطح وب است', '2021-01-31');

-- --------------------------------------------------------

--
-- Table structure for table `deleted_orders`
--

CREATE TABLE `deleted_orders` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `total_price` decimal(10,0) NOT NULL,
  `track_code` varchar(512) NOT NULL,
  `created_at` date NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `deleted_orders`
--

INSERT INTO `deleted_orders` (`id`, `user_id`, `total_price`, `track_code`, `created_at`) VALUES
(27, 10, '5000000', '1565465465421', '2021-01-28'),
(28, 14, '90000', '1565465465421', '2021-01-29'),
(29, 10, '45000', '78786786786', '2021-01-30'),
(30, 10, '2645000', '15654654654215465', '2021-01-31'),
(31, 10, '2500000', '879456432121', '2021-01-31'),
(32, 14, '3150000', '15654654654215465', '2021-01-31'),
(33, 10, '205000', '879456432121', '2021-01-31'),
(34, 10, '90000', '15654654654218464231', '2021-01-31');

-- --------------------------------------------------------

--
-- Table structure for table `news`
--

CREATE TABLE `news` (
  `id` int(11) NOT NULL,
  `text` text NOT NULL,
  `created_at` date NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `news`
--

INSERT INTO `news` (`id`, `text`, `created_at`) VALUES
(1, 'خبر جدید فروشگاه بزودی برای تمام محصولات 50 درصد تخفیف در نظر می گیرد', '2021-01-30'),
(2, 'خبر جدید 2 فروشگاه بزودی برای تمام محصولات 70 درصد تخفیف در نظر می گیرد', '2021-01-30'),
(4, 'خبر جدید فروشگاه بزودی برای تمام محصولات 50 درصد تخفیف در نظر می گیرد آزمایشی', '2021-01-31');

-- --------------------------------------------------------

--
-- Table structure for table `orders`
--

CREATE TABLE `orders` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `total_price` decimal(10,0) NOT NULL,
  `track_code` varchar(512) NOT NULL,
  `is_confirmed` int(11) NOT NULL DEFAULT 0,
  `created_at` date NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `orders`
--

INSERT INTO `orders` (`id`, `user_id`, `total_price`, `track_code`, `is_confirmed`, `created_at`) VALUES
(40, 14, '7600000', '15654654654215465', 1, '2021-01-31');

-- --------------------------------------------------------

--
-- Table structure for table `order_details`
--

CREATE TABLE `order_details` (
  `id` int(11) NOT NULL,
  `order_id` int(11) NOT NULL,
  `product_id` int(11) NOT NULL,
  `product_quantity` int(11) NOT NULL,
  `is_confirmed` int(11) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `order_details`
--

INSERT INTO `order_details` (`id`, `order_id`, `product_id`, `product_quantity`, `is_confirmed`) VALUES
(63, 40, 23, 2, 1),
(64, 40, 18, 4, 1),
(65, 40, 21, 1, 1);

-- --------------------------------------------------------

--
-- Table structure for table `products`
--

CREATE TABLE `products` (
  `id` int(11) NOT NULL,
  `title` varchar(512) NOT NULL,
  `description` text NOT NULL,
  `cat_id` int(11) NOT NULL,
  `price` decimal(10,0) NOT NULL,
  `photo` varchar(256) NOT NULL,
  `stock` int(11) NOT NULL DEFAULT 0,
  `buy_count` int(11) NOT NULL DEFAULT 0,
  `created_at` date NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `products`
--

INSERT INTO `products` (`id`, `title`, `description`, `cat_id`, `price`, `photo`, `stock`, `buy_count`, `created_at`) VALUES
(17, 'محصول شماره 26', 'توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 توضیحات 26 ', 7, '45000', '1681_photo.jpg', 5, 0, '2021-01-29'),
(18, 'محصول شماره 1پ33', 'محصول شماره 1پ33 محصول شماره 1پ33 محصول شماره 1پ33 محصول شماره 1پ33 محصول شماره 1پ33 محصول شماره 1پ33 محصول شماره 1پ33 محصول شماره 1پ33 محصول شماره 1پ33 محصول شماره 1پ33 محصول شماره 1پ33 محصول شماره 1پ33 محصول شماره 1پ33 محصول شماره 1پ33 محصول شماره 1پ33 محصول شماره 1پ33 محصول شماره 1پ33 محصول شماره 1پ33 محصول شماره 1پ33 محصول شماره 1پ33 محصول شماره 1پ33 محصول شماره 1پ33 محصول شماره 1پ33 محصول شماره 1پ33 محصول شماره 1پ33 محصول شماره 1پ33 محصول شماره 1پ33 محصول شماره 1پ33 محصول شماره 1پ33 ', 1, '25000', '5060_photo.jpg', -1, 5, '2021-01-29'),
(19, 'محصول شماره 1 6565', 'محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 محصول شماره 1 6565 ', 1, '45000', '4750_photo.jpg', 6, 4, '2021-01-29'),
(20, 'محصول شماره 1 565700', 'محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 محصول شماره 1 565700 ', 1, '600000', '8161_photo.jpg', 5, 4, '2021-01-29'),
(21, 'محصول شماره 656s ss', 'محصول شماره 656s ss محصول شماره 656s ss محصول شماره 656s ss محصول شماره 656s ss محصول شماره 656s ss محصول شماره 656s ss محصول شماره 656s ss محصول شماره 656s ss محصول شماره 656s ss محصول شماره 656s ss محصول شماره 656s ss محصول شماره 656s ss محصول شماره 656s ss محصول شماره 656s ss محصول شماره 656s ss محصول شماره 656s ss محصول شماره 656s ss محصول شماره 656s ss محصول شماره 656s ss محصول شماره 656s ss محصول شماره 656s ss محصول شماره 656s ss محصول شماره 656s ss محصول شماره 656s ss محصول شماره 656s ss محصول شماره 656s ss محصول شماره 656s ss محصول شماره 656s ss محصول شماره 656s ss محصول شماره 656s ss محصول شماره 656s ss محصول شماره 656s ss محصول شماره 656s ss محصول شماره 656s ss محصول شماره 656s ss محصول شماره 656s ss محصول شماره 656s ss محصول شماره 656s ss محصول شماره 656s ss محصول شماره 656s ss محصول شماره 656s ss محصول شماره 656s ss محصول شماره 656s ss محصول شماره 656s ss محصول شماره 656s ss محصول شماره 656s ss محصول شماره 656s ss محصول شماره 656s ss محصول شماره 656s ss محصول شماره 656s ss ', 1, '2500000', '1232_photo.jpg', 1, 1, '2021-01-29'),
(22, 'محصول شماره 15464', 'محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 محصول شماره 15464 ', 1, '50000', '1107_photo.jpg', 3, 0, '2021-01-29'),
(23, 'محصول شماره 1999', ' محصول شماره 1999 محصول شماره 1999  محصول شماره 1999 محصول شماره 1999  محصول شماره 1999 محصول شماره 1999  محصول شماره 1999 محصول شماره 1999  محصول شماره 1999 محصول شماره 1999  محصول شماره 1999 محصول شماره 1999  محصول شماره 1999 محصول شماره 1999  محصول شماره 1999 محصول شماره 1999  محصول شماره 1999 محصول شماره 1999  محصول شماره 1999 محصول شماره 1999  محصول شماره 1999 محصول شماره 1999  محصول شماره 1999 محصول شماره 1999  محصول شماره 1999 محصول شماره 1999  محصول شماره 1999 محصول شماره 1999  محصول شماره 1999 محصول شماره 1999  محصول شماره 1999 محصول شماره 1999  محصول شماره 1999 محصول شماره 1999  محصول شماره 1999 محصول شماره 1999  محصول شماره 1999 محصول شماره 1999  محصول شماره 1999 محصول شماره 1999  محصول شماره 1999 محصول شماره 1999  محصول شماره 1999 محصول شماره 1999  محصول شماره 1999 محصول شماره 1999  محصول شماره 1999 محصول شماره 1999  محصول شماره 1999 محصول شماره 1999  محصول شماره 1999 محصول شماره 1999  محصول شماره 1999 محصول شماره 1999  محصول شماره 1999 محصول شماره 1999  محصول شماره 1999 محصول شماره 1999  محصول شماره 1999 محصول شماره 1999  محصول شماره 1999 محصول شماره 1999  محصول شماره 1999 محصول شماره 1999 ', 1, '2500000', '3959_photo.jpg', 0, 2, '2021-01-29'),
(24, 'محصول شماره 35769', 'محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 محصول شماره 35769 ', 9, '2500000', 'product-13.jpg', 3, 0, '2021-01-30');

-- --------------------------------------------------------

--
-- Table structure for table `slider`
--

CREATE TABLE `slider` (
  `id` int(11) NOT NULL,
  `path` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `slider`
--

INSERT INTO `slider` (`id`, `path`) VALUES
(3, 'images/slider/slide1.jpg'),
(8, 'images/slider/slide2.jpg');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `name` varchar(512) NOT NULL,
  `email` varchar(256) NOT NULL,
  `password` varchar(256) NOT NULL,
  `address` text NOT NULL,
  `buy_count` int(11) NOT NULL DEFAULT 0,
  `created_at` date NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `name`, `email`, `password`, `address`, `buy_count`, `created_at`) VALUES
(9, 'حسین محمدی', 'asda@asd', '$2y$12$C4VXj6LSH57fUe9d4Li1Yuz4lu1Tbg26spePUYwDtPxSlzUiqUCTW', 'ایران', 0, '2021-01-22'),
(10, 'مهران 22', 'meh@gmail.com', '$2y$12$RTe2EVZc5ps5YC4ObcoP2OBmuXBAvXYFKV95sJ13ZVcuq4m1R0eQ2', 'تهران - ورامین - کوچه 12 - پلاک 55', 0, '2021-01-22'),
(12, 'مهران 2', 'me2h@gmail.com', '$2y$12$.2cRMUDdt3MLk8twfAO62.puF4NYOblsgqUZVf10XOornwi09z30C', 'تهران - ورامین 2', 0, '2021-01-22'),
(14, 'محمد محمدی 2', 'mohammad@gmail.com', '$2y$12$xti1i4xvTnAD4D5o.3JUjucffkskBeq59uEYFvvnSulD3sZUWEhhG', 'آذربایجان شرقی - میانه - خیابان 31 - کوچه 12 - پلاک 655', 0, '2021-01-29'),
(15, 'سارا محمدی', 'sara@gmail.com', '$2y$12$wsy2Ja.U2TqUG/0cN66KFepH6/eeaAPAW5MBdm3BWQrGz9xhEU.eq', 'تهران - سعادت آباد - کوچه 12 - پلاک 982', 0, '2021-01-30'),
(16, 'محمد حسینی', 'mohammad_1@gmail.com', '$2y$12$BvbMs5z3Lg/Mj4PwSRFbEODeD1a57O.vaEmcSan0CUCeD1gV4GPJe', 'تهران - ورامین - کوچه 12 - پلاک 98', 0, '2021-01-31');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `admin_users`
--
ALTER TABLE `admin_users`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `contact_us`
--
ALTER TABLE `contact_us`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `deleted_orders`
--
ALTER TABLE `deleted_orders`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `news`
--
ALTER TABLE `news`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `orders`
--
ALTER TABLE `orders`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `order_details`
--
ALTER TABLE `order_details`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `slider`
--
ALTER TABLE `slider`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `admin_users`
--
ALTER TABLE `admin_users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT for table `categories`
--
ALTER TABLE `categories`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT for table `contact_us`
--
ALTER TABLE `contact_us`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `deleted_orders`
--
ALTER TABLE `deleted_orders`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=35;

--
-- AUTO_INCREMENT for table `news`
--
ALTER TABLE `news`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `orders`
--
ALTER TABLE `orders`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=42;

--
-- AUTO_INCREMENT for table `order_details`
--
ALTER TABLE `order_details`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=67;

--
-- AUTO_INCREMENT for table `products`
--
ALTER TABLE `products`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=25;

--
-- AUTO_INCREMENT for table `slider`
--
ALTER TABLE `slider`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
